
# 文本转tts，并播放
'''

'''
import ollama
import pyttsx3

# 输出文本



def ollama_image_caption(msg):
    client = ollama.Client(host='http://localhost:11434')
    # 将图片转换为 base64 编码
    # base64_image = image_to_base64(image_path)
    # 设置提示语，引导模型对图片进行描述
    prompt = msg or "根据图写一篇200字的中文作文："
    response = client.generate(
        model='llama3.2', prompt=prompt)
    return response



def pyttsx3_speech(text):
    engine = pyttsx3.init()
    # 设置语速，默认值为 200
    engine.setProperty('rate', 150)
    # 设置音量，范围从 0 到 1
    engine.setProperty('volume', 0.8)
    engine.say(text)
    engine.runAndWait()
# 调用
# caption = ollama_image_caption('作业帮')
caption = ollama_image_caption('元宵节')
print(caption)


# 可以播放语音
pyttsx3_speech(caption['response'])




'''
[Running] python -u "/Users/apple/github/ollama-study/demos/tts.py"
结果会自动朗读语音
输出结果：


model='llama3.2'
created_at='2025-02-12T05:56:14.199657Z' 
done=True
done_reason='stop' 
total_duration=22908570080 
load_duration=27650518 
prompt_eval_count=29
prompt_eval_duration=689000000
eval_count=261 eval_duration=22189000000 response='元宵节（元旦）是中国传统的春节前夕的重要节日。它通常发生在农历除夕和正月初一之间，具体日期会因不同地区有所不同。\n\n元宵节的历史很深， dating back to Han Dynasty（206 BCE-220 CE）。当时，Chinese 人们会在农历除夕和正月初一这两个日子里庆祝，通常包括一些传统活动，如：\n\n1. **光明节**:  chinese people will light candles, lanterns and fireworks to symbolize the banishment of darkness and evil spirits.\n2.  **清洁**: people will clean their homes and streets to drive away bad luck and evil spirits.\n3.  **饮酒和歌舞**: families will gather together to drink wine, eat traditional foods like niangao (sticky rice cake) and dumplings, and sing and dance.\n\n元宵节的重要性在于它标志着春节的开始，代表着新的一年和新的一生。许多中国人会为这一日子准备特别的装饰、传统活动和礼物，来庆祝这一重要节日。\n\n您想了解什么关于元宵节？' 
context=[128006, 9125, 128007, 271, 38766, 1303, 33025, 2696, 25, 6790, 220, 2366, 18, 271, 128009, 128006, 882, 128007, 271, 24186, 8676, 113, 56602, 128009, 128006, 78191, 128007, 271, 24186, 8676, 113, 56602, 10110, 24186, 121022, 7705, 21043, 59795, 42783, 55758, 9554, 104149, 56602, 25580, 118705, 9554, 107693, 56602, 9080, 1811, 103282, 117032, 110105, 19000, 107019, 82302, 21418, 118705, 34208, 37656, 9953, 85707, 15120, 113778, 3922, 118789, 46885, 38093, 63212, 107653, 109224, 19361, 32938, 107653, 3490, 24186, 8676, 113, 56602, 9554, 113691, 101600, 102987, 3922, 5029, 1203, 311, 21296, 74495, 10110, 11056, 79677, 12, 8610, 27809, 75376, 40265, 13646, 3922, 46023, 102362, 80578, 38093, 19000, 107019, 82302, 21418, 118705, 34208, 37656, 9953, 85707, 15120, 44388, 110835, 9080, 45829, 70349, 110736, 114166, 3922, 117032, 108399, 113882, 42783, 55758, 108726, 116051, 49543, 16, 13, 3146, 101426, 31958, 56602, 96618, 220, 57487, 1274, 690, 3177, 52305, 11, 74265, 82, 323, 52933, 311, 7891, 553, 279, 9120, 16409, 315, 27394, 323, 14289, 31739, 627, 17, 13, 220, 3146, 80866, 121730, 96618, 1274, 690, 4335, 872, 10632, 323, 14708, 311, 6678, 3201, 3958, 15369, 323, 14289, 31739, 627, 18, 13, 220, 3146, 120522, 103882, 34208, 104261, 107875, 96618, 8689, 690, 9762, 3871, 311, 7172, 13378, 11, 8343, 8776, 15657, 1093, 13080, 526, 3524, 320, 56542, 20228, 19692, 8, 323, 63811, 81402, 11, 323, 7936, 323, 15612, 382, 24186, 8676, 113, 56602, 9554, 107693, 34171, 19000, 35304, 103282, 31944, 78228, 100815, 104149, 56602, 9554, 56386, 3922, 106691, 100815, 17039, 105067, 8107, 34208, 17039, 105067, 21990, 1811, 119796, 59795, 17792, 38093, 18184, 113418, 9080, 45829, 115996, 118021, 9554, 99741, 115943, 5486, 42783, 55758, 108726, 34208, 107591, 53953, 3922, 37507, 110736, 114166, 113418, 107693, 56602, 9080, 3490, 88126, 101067, 114706, 101879, 111912, 24186, 8676, 113, 56602, 11571]
'''


     